.config/doom/config.org
#+TITLE: Alex Birdsall's doom emacs config
#+startup: overview
#+PROPERTY: header-args :noweb yes

This is my doom config. It's a literate config, so the code snippets are living documentation; they
get exported to specific init files.

* reference
** keybindings in doom
:PROPERTIES:
:VISIBILITY: folded
:END:
This will define =SPC f b b= to invoke foo-bar-baz and =SPC f b q= to invoke foo-bar-qux.
#+begin_src elisp :tangle no
(map! :leader

	(:prefix-map ("f" . "foo")
		(:prefix ("b" . "bar")
		:desc "Baz" "b" #'foo-bar-baz
		:desc "Qux" "q" #'foo-bar-qux)))
#+end_src

** emacs package wish/learning list
:PROPERTIES:
:VISIBILITY: folded
:END:
*** actually installed
**** [[https://github.com/abo-abo/auto-yasnippet][aya]] :: auto-yasnippet (installed by doom)
**** [[https://github.com/oantolin/embark][embark]]
*** wishing and thinking
**** [[https://github.com/thisisran/nova][nova]] :: stylish-compatible svg child frames

* begin config files at the beginning
#+begin_src elisp
<<config-preamble>>
#+end_src

In order to conditionally define config, we have some toggles which can be overridden via a non-git-tracked local file:
#+begin_src elisp
<<default-toggles>>
<<load-local-toggle-overrides>>
#+end_src

#+begin_src elisp :tangle packages.el
<<packages-preamble>>
#+end_src

#+begin_src elisp :tangle init.el
<<init-preamble>>

<<init-preconfig>>

<<doom-block>>
#+end_src

* doom modules
#+begin_src elisp :tangle no :noweb-ref doom-block
(doom!
 <<doom-modules>>)
#+end_src

** installation
To bootstrap a literate =init.el= on a new computer, it's necessary to first run something like
#+begin_src shell :tangle no
echo "(doom! :config literate)" > ~/.config/doom/init.el
#+end_src
so that the /actual/ module selections will be tangled upon running ~doom {install,sync}~;
however, these dotfiles do that for you (me) via ~make install~, so this note is primarily
for the benefit of a hypothetical reader hoping to yoink the emacs config, the whole emacs
config, and nothing but the emacs config. Look, you never know.

** =:input=
#+begin_src elisp :tangle no :noweb-ref -doom-modules
:input
;;chinese
;;japanese
;;layout            ; auie,ctsrnm is the superior home row
#+end_src

** =:completion=
#+begin_src elisp :tangle no :noweb-ref doom-modules
:completion
(company          ; the ultimate code completion backend
 +childframe)
(vertico +icons)
#+end_src

#+begin_src elisp :tangle no :noweb-ref -doom-modules
;; (corfu +icons +orderless)  ; complete with cap(f), cape and a flying feather!
;; helm              ; the *other* search engine for love and life
;;ido               ; the other *other* search engine...
;; ivy               ; a search engine for love and life
#+end_src

** =:ui=
#+begin_src elisp :tangle no :noweb-ref doom-modules

:ui
<<doom-modules-ui>>
#+end_src

#+begin_src elisp :tangle no :noweb-ref doom-modules-ui
doom              ; what makes DOOM look the way it does
doom-dashboard    ; a nifty splash screen for Emacs
(emoji +unicode)  ; 🙂
hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
(:if (display-graphic-p)
    (ligatures
     +extra))    ; ligatures and symbols to make your code pretty again
modeline          ; snazzy, Atom-inspired modeline, plus API
ophints           ; highlight the region an operation acts on
(popup +defaults)   ; tame sudden yet inevitable temporary windows
(vc-gutter +pretty) ; vcs diff in the fringe
vi-tilde-fringe   ; fringe tildes to mark beyond EOB
workspaces        ; tab emulation, persistence & separate workspaces
zen               ; distraction-free coding or writing
#+end_src

#+begin_src elisp :tangle no :noweb-ref -doom-modules-ui
;;deft              ; notational velocity for Emacs
;; doom-quit         ; DOOM quit-message prompts when you quit Emacs
;; indent-guides     ; highlighted indent columns
;;minimap           ; show a map of the code on the side
;;nav-flash         ; blink cursor line after big motions
;;neotree           ; a project drawer, like NERDTree for vim
;;tabs              ; a tab bar for Emacs
;;treemacs          ; a project drawer, like neotree but cooler
;;unicode           ; extended unicode support for various languages
;;window-select     ; visually switch windows
#+end_src

** =:editor=
#+begin_src elisp :tangle no :noweb-ref doom-modules

:editor
<<doom-modules-editor>>
#+end_src

#+begin_src elisp :tangle no :noweb-ref doom-modules-editor
(evil +everywhere +hybrid) ; come to the dark side, we have cookies
file-templates     ; auto-snippets for empty files
fold               ; (nigh) universal code folding
(format +onsave) ;; when commented out, $DAYJOB has too many badly-formatted files
;;format ; automated prettiness
snippets           ; my elves. They type so I don't have to
#+end_src

#+begin_src elisp :tangle no :noweb-ref -doom-modules-editor
;;god              ; run Emacs commands without modifier keys
;;lispy            ; vim for lisp, for people who don't like vim
;;multiple-cursors ; editing in many places at once
;;objed            ; text object editing for the innocent
;;parinfer         ; turn lisp into python, sort of
;;rotate-text      ; cycle region at point between text candidates
;;word-wrap        ; soft wrapping with language-aware indent
#+end_src

** =:emacs=
#+begin_src elisp :tangle no :noweb-ref doom-modules

:emacs
<<doom-modules-emacs>>
#+end_src

#+begin_src elisp :tangle no :noweb-ref doom-modules-emacs
undo                ; persistent, smarter undo for your inevitable mistakes
vc                  ; version-control and Emacs, sitting in a tree
#+end_src

#+begin_src elisp :tangle no :noweb-ref -doom-modules-emacs
;;electric            ; smarter, keyword-based electric-indent
;;ibuffer           ; interactive buffer management
#+end_src

** =:term=
#+begin_src elisp :tangle no :noweb-ref doom-modules

:term
<<doom-modules-term>>
#+end_src

#+begin_src elisp :tangle no :noweb-ref doom-modules-term
vterm             ; the best terminal emulation in Emacs
#+end_src

#+begin_src elisp :tangle no :noweb-ref -doom-modules-term
;;eshell            ; the elisp shell that works everywhere
;;shell             ; simple shell REPL for Emacs
;;term              ; basic terminal emulator for Emacs
#+end_src

** =:checkers=
#+begin_src elisp :tangle no :noweb-ref doom-modules

:checkers
<<doom-modules-checkers>>
#+end_src

#+begin_src elisp :tangle no :noweb-ref doom-modules-checkers
syntax            ; tasing you for every semicolon you forget
#+end_src

#+begin_src elisp :tangle no :noweb-ref -doom-modules-checkers
;;spell             ; tasing you for misspelling mispelling
;;grammar           ; tasing grammar mistake every you make
#+end_src

** =:tools=
#+begin_src elisp :tangle no :noweb-ref doom-modules

:tools
<<doom-modules-tools>>
#+end_src

#+begin_src elisp :tangle no :noweb-ref doom-modules-tools
(debugger +lsp)     ; FIXME stepping through code, to help you add bugs
direnv
docker
editorconfig      ; let someone else argue about tabs vs spaces
(eval +overlay)     ; run code, run (also, repls)
(lookup +docsets)   ; navigate your code and its documentation
(lsp +peek)
(magit
+forge)          ; a git porcelain for Emacs
make              ; run make tasks from Emacs
pdf               ; pdf enhancements
tmux              ; an API for interacting with tmux
tree-sitter       ; syntax and parsing, sitting in a tree...
#+end_src

#+begin_src elisp :tangle no :noweb-ref -doom-modules-tools
;;ansible
;;biblio            ; Writes a PhD for you (citation needed)
;;collab            ; buffers with friends
;;ein               ; tame Jupyter notebooks with emacs
;;gist              ; interacting with github gists
;;pass              ; password manager for nerds
;;prodigy           ; FIXME managing external services & code builders
;;rgb               ; creating color strings
;;terraform         ; infrastructure as code
;;upload            ; map local to remote projects via ssh/ftp
#+end_src

** =:os=
#+begin_src elisp :tangle no :noweb-ref doom-modules

:os
<<doom-modules-os>>
#+end_src

#+begin_src elisp :tangle no :noweb-ref doom-modules-os
(:if IS-MAC macos)  ; improve compatibility with macOS
tty               ; improve the terminal Emacs experience
#+end_src

** =:lang=
#+begin_src elisp :tangle no :noweb-ref doom-modules

:lang
<<doom-modules-lang>>
#+end_src

#+begin_src elisp :tangle no :noweb-ref doom-modules-lang
(clojure +lsp +treesitter)           ; java with a lisp
data              ; config/data formats
(elixir +lsp)            ; erlang done right
emacs-lisp        ; drown in parentheses
(json +lsp)              ; At least it ain't XML
(javascript
  +lsp
  +tree-sitter)        ; all(hope(abandon(ye(who(enter(here))))))
(lua
  +fennel
  +lsp)                 ; one-based indices? one-based indices
markdown            ; writing docs for people to ignore
(org                ; organize your plain life in plain text
  +pretty
  +dragndrop
  +present
  +gnuplot
  +roam2)
(python             ; beautiful is better than ugly
  +lsp
  +pyright
  +tree-sitter)
rest              ; Emacs as a REST client
(ruby
  +rails
  +rbenv
  +lsp
  +tree-sitter)        ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
(scheme +guile)   ; a fully conniving family of lisps

(sh
  +lsp
  +tree-sitter)        ; she sells {ba,z,fi}sh shells on the C xor
(web
  +lsp
  +tree-sitter)        ; the tubes
(yaml
  + lsp
  +tree-sitter)        ; JSON, but readable
#+end_src

#+begin_src elisp :tangle no :noweb-ref -doom-modules-lang
;;agda              ; types of types of types of types...
;;beancount         ; mind the GAAP
;; cc                ; C/C++/Obj-C madness
;;(clojure +lsp)           ; java with a lisp
;;common-lisp       ; if you've seen one lisp, you've seen them all
;;coq               ; proofs-as-programs
;;crystal           ; ruby at the speed of c
;;csharp            ; unity, .NET, and mono shenanigans
;;(dart +flutter)   ; paint ui and not much else
;;dhall
;;elm               ; care for a cup of TEA?
;;erlang            ; an elegant language for a more civilized age
;;ess               ; emacs speaks statistics
;;factor
;;faust             ; dsp, but you get to keep your soul
;;fortran           ; in FORTRAN, GOD is REAL (unless declared INTEGER)
;;fsharp            ; ML stands for Microsoft's Language
;;fstar             ; (dependent) types and (monadic) effects and Z3
;;gdscript          ; the language you waited for
;;(go +lsp)         ; the hipster dialect
;;(graphql +lsp)    ; Give queries a REST
;;(haskell +lsp)    ; a language that's lazier than I am
;;hy                ; readability of scheme w/ speed of python
;;idris             ; a language you can depend on
;; (:if IS-LINUX
;;     (java
;;      +meghanada
;;      +tree-sitter)) ; the poster child for carpal tunnel syndrome
;; (:if IS-MAC
;;     (java
;;      +tree-sitter)) ; the poster child for carpal tunnel syndrome
;;julia             ; a better, faster MATLAB
;; (kotlin +lsp)            ; a better, slicker Java(Script)
;;latex             ; writing papers in Emacs has never been so fun
;;lean
;;ledger            ; an accounting system in Emacs
;;nim               ; python + lisp at the speed of c
;;nix               ; I hereby declare "nix geht mehr!"
;;ocaml             ; an objective camel
;;php               ; perl's insecure younger brother
;;plantuml          ; diagrams for confusing people more
;;purescript        ; javascript, but functional
;;qt                ; the 'cutest' gui framework ever
;;racket            ; a DSL for DSLs
;;raku              ; the artist formerly known as perl6
;;rst               ; ReST in peace
;;(rust +lsp)       ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
;;scala             ; java, but good
;;sml
;;solidity          ; do you need a blockchain? No.
;;swift             ; who asked for emoji variables?
;;terra             ; Earth and Moon in alignment for performance.
;;zig               ; C, but simpler
#+end_src

** =:email=
#+begin_src elisp :tangle no :noweb-ref -doom-modules

:email
<<doom-modules-email>>
#+end_src

#+begin_src elisp :tangle no :noweb-ref doom-modules-email
;;(mu4e +org +gmail)
;;notmuch
;;(wanderlust +gmail)
#+end_src

** =:app=
#+begin_src elisp :tangle no :noweb-ref -doom-modules

:app
<<doom-modules-app>>
#+end_src

#+begin_src elisp :tangle no :noweb-ref doom-modules-app
;;calendar
;;;everywhere        ; *leave* Emacs!? You must be joking
;;irc               ; how neckbeards socialize
;;(rss +org)        ; emacs as an RSS reader
#+end_src

