.config/doom/init.el
 (default +bindings +smartparens))
